Repository: lacombet/EmptyEpsilon
Catalog: resources/locale/shipTemplates_Corvette.*.po
Languages: fr

source: The Atlantis X23 is the smallest model of destroyer, and its combination of frigate-like size and corvette-like power makes it an excellent escort ship when defending larger ships against multiple smaller enemies. Because the Atlantis X23 is fitted with a jump drive, it can also serve as an intersystem patrol craft.
fr: Le Atlantis X23 allie le petit gabarit d'une frégate à la puissance de feu d'une corvette. Ces attouts en font un excellent vaisseau d'escorte particulièrement efficace lorsqu'il s'agit de défendre d'imposants vaisseaux contre de multiples ennemis plus petits. Son moteur de saut en fait également un patrouilleur inter-systèmes remarquable.

source: A refitted Atlantis X23 for more general tasks. The large shield system has been replaced with an advanced combat maneuvering systems and improved impulse engines. Its missile loadout is also more diverse. Mistaking the modified Atlantis for an Atlantis X23 would be a deadly mistake.
fr: Un Atlantis X23 réaménagé pour des tâches plus générales. Le système de bouclier fait place à un moteur à impulsion plus performant, permettant notament l'execution de manoeuvre de combat avancées. Son armement est également plus diversifié que celui de son homologue. Prendre un Atlantis modifié pour un Atlantis X23 serait une erreur fatale.

source: Contrary to its predecessor, the Starhammer II lives up to its name. By resolving the original Starhammer's power and heat management issues, the updated model makes for a phenomenal frontal assault ship. Its low speed makes it difficult to position, but when in the right place at the right time, even the strongest shields can't withstand a Starhammer's assault for long.
fr: Contrairement à son prédécesseur, le Starhammer II fait honneur à son nom. En résolvant les problèmes de gestion de la puissance et de la chaleur du Starhammer original, le modèle actualisé constitue un vaisseau d'assaut frontal phénoménal. Sa faible vitesse le rend difficile à manoeuvrer mais même les boucliers les plus solides ne peuvent résister longtemps à ses assaults.

source: Crucible
fr: Creuset

source: Popper
fr: Artilleur

source: A number of missile tubes range around this ship. Beams were deemed lower priority, though they are still present. Stronger defenses than a frigate, but not as strong as the Atlantis
fr: Ce vaisseau est couvert de tubes de lancement de missiles. Bien que toujours présents, les armes à faisceaux ne font office que d'armes d'appoint. Ses défenses sont plus solides qu'une frégate, mais pas aussi solides que celles de l'Atlantis

source: Gunner
fr: Canonnière

source: A number of beams bristle from various points on this gunner. Missiles were deemed lower priority, though they are still present. Stronger defenses than a frigate, but not as strong as the Atlantis
fr: Un certain nombre d'armes à faisceaux parsèment cette canonniere. Elle emporte quelques missiles bien qu'ils ne soient pas ses armes de prédilection. Ses défenses sont plus solides qu'une frégate, mais pas aussi solides que celles de l'Atlantis

source: Defense platform
fr: Plateforme de défense

source: Support
fr: Soutien

source: This stationary defense platform operates like a station, with docking and resupply functions, but is armed with powerful beam weapons and can slowly rotate. Larger systems often use these platforms to resupply patrol ships.
fr: Une plateforme de défense est stationnaire. Elle opère à la manière d'une station, avec des fonctions d'amarrage et de réapprovisionnement, mais elle est armée de puissantes armes à faisceau et peut pivoter lentement. Les systèmes les plus importants utilisent souvent ces plateformes pour réapprovisionner les vaisseaux de patrouille.

source: Personnel Freighter %d
fr: Navette %d

source: Freighter
fr: Cargo

source: Personnel Jump Freighter %d
fr: Navette LD %d

source: Goods Freighter %d
fr: Transport de fret %d

source: Cargo freighters haul large loads of cargo across long distances on impulse power. Their cargo bays include climate control and stabilization systems that keep the cargo in good condition.
fr: Les transporteurs de fret acheminent de grandes quantités de marchandises sur de longues distances grâce à la puissance de leurs imposants moteurs à impulsion. Leurs soutes sont équipées de systèmes de climatisation et de stabilisation permettant le maintien de la cargaison en bon état.

source: Goods Jump Freighter %d
fr: Transport de fret LD %d

source: Garbage Freighter %d
fr: Cargo poubelle %d

source: These freighters are specially designed to haul garbage and waste. They are fitted with a trash compactor and fewer stabilzation systems than cargo freighters.
fr: Ces cargos sont spécialement conçus pour transporter des ordures et des déchets. Ils sont équipés d'un compacteur et leurs systèmes de stabilisation sont réduits au minimum.

source: Garbage Jump Freighter %d
fr: Cargo poubelle LD %d

source: Equipment Freighter %d
fr: Transport d'équipement %d

source: Equipment freighters have specialized environmental and stabilization systems to safely carry delicate machinery and complex instruments.
fr: Les transports d'équipement disposent de systèmes de stabilisation spécialisés pour transporter en toute sécurité des appareils délicats et des instruments complexes.

source: Equipment Jump Freighter %d
fr: Transport d'équipement LD %d

source: Fuel Freighter %d
fr: Cargo citerne %d

source: Fuel freighters have massive tanks for hauling fuel, and delicate internal sensors that watch for any changes to their cargo's potentially volatile state.
fr: Les pétroliers disposent d'énormes réservoirs de carburant et de capteurs internes sophistiqués capables de détecter toute variation de l'état potentiellement volatil de leur cargaison.

source: Fuel Jump Freighter %d
fr: Cargo citerne LD %d

source: Jump Carrier
fr: Remorqueur LD

source: The Jump Carrier is a specialized Freighter. It does not carry any cargo, as it's cargo bay is taken up by a specialized jump drive and the energy storage required to run this jump drive. It is designed to carry other ships deep into space. So it has special docking parameters, allowing other ships to attach themselves to this ship.
fr: Le Jump Carrier est un transporteur spécialisé. Il ne transporte aucune cargaison, car sa soute est occupée par un moteur de saut perfectionné et ses batteries massives. Il est conçu pour transporter d'autres vaisseaux à travers l'espace. Il dispose donc de paramètres d'amarrage spéciaux, permettant à d'autres navires de s'y rattacher.

source: Carrier
fr: Remorqueur

source: Benedict is an improved version of the Jump Carrier
fr: Le Benedict est une version améliorée du Remorqueur LD classique

source: Kiriya is an improved warp drive version of the Jump Carrier
fr: Le Kiriya est un Remorqueur LD pourvu d'un moteur à distorsion
